cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'

brew 'apib'
brew 'coreutils'
brew 'elixir'
brew 'go'
brew 'grc'
brew 'node'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'tree'

cask 'apache-directory-studio'
cask 'bbc-iplayer-downloads'
cask 'evernote'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'ngrok'
cask 'skype'
cask 'slack'
cask 'sublime-text'


#The following might be useful at some point
#brew 'imagemagick'
#brew 'postgresql'
#brew 'jp2a'
#brew 'ack'
#brew 'youtube-dl'

#cask '1password'
#cask 'adium'
#cask 'firefox'
#cask 'handbrake'
#cask 'mapbox-studio'
#cask 'seashore'
#cask 'steam'
#cask 'transmission'
#cask 'tunnelbear'
#cask 'vlc'
