cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'

brew 'ack'
brew 'apib'
brew 'ansible'
brew 'blink1'
brew 'coreutils'
brew 'elixir'
brew 'go'
brew 'grc'
brew 'heroku'
brew 'imagemagick'
brew 'node'
brew 'nvm'
brew 'pandoc'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'tree'

cask '1password'
cask 'apache-directory-studio'
cask 'bbc-iplayer-downloads'
cask 'blink1control'
cask 'evernote'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'ngrok'
cask 'paw'
cask 'pgadmin3'
cask 'seashore'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'sublime-text'
cask 'vlc'

#The following might be useful at some point
#brew 'jp2a'
#brew 'youtube-dl'

#cask 'adium'
#cask 'handbrake'
#cask 'steam'
#cask 'transmission'
#cask 'tunnelbear'
