cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ag'
brew 'apib'
brew 'ansible'
brew 'blink1'
brew 'coreutils'
brew 'elixir'
brew 'emacs'
brew 'go'
brew 'goreleaser'
brew 'gnu-tar'
brew 'grc'
brew 'jq'
brew 'nvm'
brew 'pandoc'
brew 'ruby-build'
brew 'rbenv'
brew 'tree'
brew 'yarn'

cask 'blink1control'
cask 'dropbox'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'ngrok'
cask 'paw'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'sublime-text'
cask 'vlc'
cask 'vnc-viewer'
cask 'whatsapp'

#The following might be useful at some point
#brew 'jp2a'
#brew 'youtube-dl'

#cask 'adium'
#cask 'handbrake'
#cask 'steam'
#cask 'tunnelbear'
